# Cleaning and Organising Data

In [1]:
import numpy as np
import random
import pandas as pd
import os
import re
%load_ext autoreload
%autoreload 2

In [2]:
!kaggle datasets download -d teajay/global-shark-attacks

Traceback (most recent call last):
  File "/usr/local/bin/kaggle", line 5, in <module>
    from kaggle.cli import main
  File "/usr/local/lib/python3.8/site-packages/kaggle/__init__.py", line 19, in <module>
    from kaggle.api.kaggle_api_extended import KaggleApi
  File "/usr/local/lib/python3.8/site-packages/kaggle/api/__init__.py", line 22, in <module>
    from kaggle.api.kaggle_api_extended import KaggleApi
  File "/usr/local/lib/python3.8/site-packages/kaggle/api/kaggle_api_extended.py", line 46, in <module>
    from ..api_client import ApiClient
  File "/usr/local/lib/python3.8/site-packages/kaggle/api_client.py", line 39, in <module>
    import six
ModuleNotFoundError: No module named 'six'

In [3]:
!tar -xzvf global-shark-attacks.zip

tar: Error opening archive: Failed to open 'global-shark-attacks.zip'

In [4]:
!mv attacks.csv ../data-cleaning-pandas/attacks.csv

In [5]:
ls

Analysis.ipynb  Clean.ipynb     README.md       attacks.csv     data_4.csv

In [6]:
!rm -rf global-shark-attacks.zip

In [7]:
pwd

'/Users/pptrv/IronHack/data-cleaning-pandas'

In [8]:
data_ = pd.read_csv('attacks.csv', encoding ='latin1')
data_.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25723 entries, 0 to 25722
Data columns (total 24 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Case Number             8702 non-null   object
 1   Date                    6302 non-null   object
 2   Year                    6300 non-null   float64
 3   Type                    6298 non-null   object
 4   Country                 6252 non-null   object
 5   Area                    5847 non-null   object
 6   Location                5762 non-null   object
 7   Activity                5758 non-null   object
 8   Name                    6092 non-null   object
 9   Sex                     5737 non-null   object
 10  Age                     3471 non-null   object
 11  Injury                  6274 non-null   object
 12  Fatal (Y/N)             5763 non-null   object
 13  Time                    2948 non-null   object
 14  Species                 3464 non-null   object
 15  Investigator or Source  6285 non-null   object
 16  pdf                     6302 non-null   object
 17  href formula            6301 non-null   object
 18  href                    6302 non-null   object
 19  Case Number.1           6302 non-null   object
 20  Case Number.2           6302 non-null   object
 21  original order          6309 non-null   float64
 22  Unnamed: 22             1 non-null      object
 23  Unnamed: 23             2 non-null      object
dtypes: float64(2), object(22)
memory usage: 4.7+ MB

Five different techniques to clean data:

1rst technique : Our Dataset

First we create a new dataset with the columns we need from dataset_1. I have selected "Case Number" as it provides with dates as an int. I have also selected Country as it will allow as to figure out if the attack ouccured in the northern of southern hemisphere.

In [9]:
data_1 = data_[['Case Number', 'Country']]
data_1.head()

  Case Number    Country
0  2018.06.25        USA
1  2018.06.18        USA
2  2018.06.09        USA
3  2018.06.08  AUSTRALIA
4  2018.06.04     MEXICO

2nd Technique: Changin column name.

We have decided to use the Case Number column as dates, as they contain less nulls and we may transform to a integer easily.

In [10]:
data_2 = data_1.rename(columns={'Case Number': 'Dates'})
data_2.head()

        Dates    Country
0  2018.06.25        USA
1  2018.06.18        USA
2  2018.06.09        USA
3  2018.06.08  AUSTRALIA
4  2018.06.04     MEXICO

3rd technique: No strings in "Dates"

I will standarize dates by eliminating the .(string) at the end of the objects.

In [11]:
data_2['Dates'] = data_2['Dates'].str.replace(r'\D', '')
data_3 = data_2
data_3.sample(10)

          Dates Country
23570       NaN     NaN
25563       NaN     NaN
22036       NaN     NaN
6710          0     NaN
24054       NaN     NaN
612    20131019     USA
20101       NaN     NaN
14826       NaN     NaN
20144       NaN     NaN
20372       NaN     NaN

4rth technique: Eliminating NaN rows

Will provide us with enough data to figure out our hipothesis, and not contaminmating our results with incomplete data.

In [12]:
data_4 = data_3.dropna() 
data_4.info()
data_4.sample(10)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6251 entries, 0 to 6301
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Dates    6251 non-null   object
 1   Country  6251 non-null   object
dtypes: object(2)
memory usage: 146.5+ KB

         Dates        Country
1296  20080114    NEW ZEALAND
2865  19850100  NEW CALEDONIA
4908  19350519   SOUTH AFRICA
1531  20051102            USA
2689  19890400            USA
3948  19601111      AUSTRALIA
2394  19950321      AUSTRALIA
2572  19920000           FIJI
2923  19830815            USA
2313  19960226      AUSTRALIA

5th Technique: Only using dates that include "year, month and day"

In [13]:
data_4['Dates'] = data_4['Dates'].str.extract(r'^(\d{8})')
data_4.sample(20)

<ipython-input-13-4922b36f3907>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_4['Dates'] = data_4['Dates'].str.extract(r'^(\d{8})')

         Dates             Country
3442  19690127           AUSTRALIA
1274  20080415                 USA
5466  19061010                 USA
5346  19140117           AUSTRALIA
5415  19090813                 USA
2055  20000509           AUSTRALIA
6202       NaN            DJIBOUTI
3105  19790300       NEW CALEDONIA
5567  18991012               LIBYA
4312  19550000          MADAGASCAR
860   20110928  DOMINICAN REPUBLIC
3339  19720316                 USA
1632  20041009                 USA
820   20120127                 USA
1734  20031005                 USA
6146  17710712                 USA
2817  19860700        SOUTH AFRICA
3963  19600918           AUSTRALIA
2791  19870000          MONTENEGRO
5695  18901230           AUSTRALIA

In [18]:
data_4['Month_Day'] = pd.to_numeric(data_4['Dates'].str[-4:])
data_4.head()

<ipython-input-18-45d0e7e71b6a>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_4['Month_Day'] = pd.to_numeric(data_4['Dates'].str[-4:])

      Dates    Country  Month_Day
0  20180625        USA      625.0
1  20180618        USA      618.0
2  20180609        USA      609.0
3  20180608  AUSTRALIA      608.0
4  20180604     MEXICO      604.0

6th technique: New column for the season

 The days for each season will be: 
  - Winter : xxxx/01/01 to xxxx/03/31
  - Spring : xxxx/04/01 to xxxx/06/31
  - Summer : xxxx/07/01 to xxxx/09/31
  - Fall : xxxx/10/01 to xxxx/12/31

In [23]:
def get_season(row):
    if row['Month_Day'] >= 101 and row['Month_Day'] <= 331:
        return 'Winter'
    elif row['Month_Day'] >= 401 and row['Month_Day'] <= 631:
        return 'Spring'
    elif row['Month_Day'] >= 701 and row['Month_Day'] <= 931:
        return 'Summer'
    elif row['Month_Day'] >= 1031 and row['Month_Day'] <= 1231:
        return 'Fall'
    else:
        return 'Nan'

data_4['Season'] = data_4.apply(get_season, axis=1)
data_4.sample(10)

<ipython-input-23-617d8533485b>:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_4['Season'] = data_4.apply(get_season, axis=1)

         Dates       Country  Month_Day  Season
571   20140322  SOUTH AFRICA      322.0  Winter
4263  19560116    COSTA RICA      116.0  Winter
3263  19740720           USA      720.0  Summer
3354  19711002           USA     1002.0     Nan
1417  20061125   PHILIPPINES     1125.0    Fall
4469  19500710           USA      710.0  Summer
1072  20091116           USA     1116.0    Fall
2698  19890120  SOUTH AFRICA      120.0  Winter
1154  20090222     AUSTRALIA      222.0  Winter
1244  20080626           USA      626.0  Spring

7th Technique: Adding a new column of attack id number

I will add a new column that provides an a number to each attack that will be usefull to assign an id to each attack.

In [33]:
data_4["Attack"] = data_4.index + 1
data_4.sample(10)

<ipython-input-33-a56a3c7c216a>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_4["Attack"] = data_4.index + 1

         Dates          Country  Month_Day  Season  Attack
5299  19161011              USA     1011.0     Nan    5300
3644  19650000              USA        0.0     Nan    3645
4168  19580127        AUSTRALIA      127.0  Winter    4169
5866  18760604              USA      604.0  Spring    5867
5248  19210822            HAITI      822.0  Summer    5249
5186  19240328  SOLOMON ISLANDS      328.0  Winter    5187
425   20150509    NEW CALEDONIA      509.0  Spring     426
1305  20071210              USA     1210.0    Fall    1306
4084  19590723              USA      723.0  Summer    4085
1054  20100109          VIETNAM      109.0  Winter    1055

Cleaned dataset:

In [32]:
final_data = data_4

In [34]:
final_data.to_csv(r'/Users/pptrv/IronHack/data-cleaning-pandas/final_data.csv')